Revit 2027 API
ParameterTypeId.ContinuousrailExtensionLengthParam Property
 "Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ContinuousrailExtensionLengthParam { get; }
Public Shared ReadOnly Property ContinuousrailExtensionLengthParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ContinuousrailExtensionLengthParam {
	ForgeTypeId^ get ();
}
static member ContinuousrailExtensionLengthParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace